Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MM_GPM_DFP/1.3.50/edc/PIC32MM0064GPM048.PIC
      <edc:SFRDef edc:_addr="0x1F800280" edc:_begin="0x0" edc:_end="0x90" edc:_modsrc="DOS-01512_ccp_mccp_upb_v1_32bit.Module" edc:_refcount="2" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CCP2BUF" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="CCP2BUF" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="CCP2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="BUFL" edc:desc="" edc:mask="0xffff" edc:name="BUFL" edc:nzwidth="16"/>
            <edc:SFRFieldDef edc:cname="BUFH" edc:desc="" edc:mask="0xffff" edc:name="BUFH" edc:nzwidth="16"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="BUF" edc:desc="" edc:mask="0xffffffff" edc:name="BUF" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F800290" edc:offset="0x70"/>
      <edc:SFRDef edc:_addr="0x1F800300" edc:_begin="0x0" edc:_end="0x90" edc:_modsrc="DOS-01512_ccp_mccp_upb_v1_32bit.Module" edc:_refcount="3" edc:access="nn--nnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CCP3CON1" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00--0000000000000000000000000000" edc:name="CCP3CON1" edc:nzwidth="0x20" edc:por="00--0000000000000000000000000000" edc:portals="CLR SET INV" ltx:baseofperipheral="CCP3">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="MOD" edc:desc="" edc:mask="0xf" edc:name="MOD" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="CCSEL" edc:desc="" edc:mask="0x1" edc:name="CCSEL" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="T32" edc:desc="" edc:mask="0x1" edc:name="T32" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="TMRPS" edc:desc="" edc:mask="0x3" edc:name="TMRPS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="CLKSEL" edc:desc="" edc:mask="0x7" edc:name="CLKSEL" edc:nzwidth="3"/>
            <edc:SFRFieldDef edc:cname="TMRSYNC" edc:desc="" edc:mask="0x1" edc:name="TMRSYNC" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CCPSLP" edc:desc="" edc:mask="0x1" edc:name="CCPSLP" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SIDL" edc:desc="" edc:mask="0x1" edc:name="SIDL" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="FRZ" edc:ishidden="true" edc:islanghidden="true" edc:mask="0x1" edc:name="FRZ" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SYNC" edc:desc="" edc:mask="0x1f" edc:name="SYNC" edc:nzwidth="5"/>
            <edc:SFRFieldDef edc:cname="ALTSYNC" edc:desc="" edc:mask="0x1" edc:name="ALTSYNC" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ONESHOT" edc:desc="" edc:mask="0x1" edc:name="ONESHOT" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="TRIGEN" edc:desc="" edc:mask="0x1" edc:name="TRIGEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OPS" edc:desc="" edc:mask="0xf" edc:name="OPS" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="RTRGEN" edc:desc="" edc:mask="0x1" edc:name="RTRGEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OPSSRC" edc:desc="" edc:mask="0x1" edc:name="OPSSRC" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:FreezeBit edc:freezeval="1" edc:name="CCP 3" edc:pos="14"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F800310" edc:_begin="0x0" edc:_end="0x90" edc:_modsrc="DOS-01512_ccp_mccp_upb_v1_32bit.Module" edc:_refcount="3" edc:access="n-nnnnnnnn-nnnnnnn-n----nnnnnnnn" edc:cname="CCP3CON2" edc:desc="" edc:impl="0xbfdfd0ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0-00000100-0000000-0----00000000" edc:name="CCP3CON2" edc:nzwidth="0x20" edc:por="0-00000100-0000000-0----00000000" edc:portals="CLR SET INV" ltx:memberofperipheral="CCP3">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ASDG" edc:desc="" edc:mask="0xff" edc:name="ASDG" edc:nzwidth="8"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="SSDG" edc:desc="" edc:mask="0x1" edc:name="SSDG" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ASDGM" edc:desc="" edc:mask="0x1" edc:name="ASDGM" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="PWMRSEN" edc:desc="" edc:mask="0x1" edc:name="PWMRSEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ICS" edc:desc="" edc:mask="0x7" edc:name="ICS" edc:nzwidth="3"/>
            <edc:SFRFieldDef edc:cname="AUXOUT" edc:desc="" edc:mask="0x3" edc:name="AUXOUT" edc:nzwidth="2"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ICGSM" edc:desc="" edc:mask="0x3" edc:name="ICGSM" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="OCAEN" edc:desc="" edc:mask="0x1" edc:name="OCAEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OCBEN" edc:desc="" edc:mask="0x1" edc:name="OCBEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OCCEN" edc:desc="" edc:mask="0x1" edc:name="OCCEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OCDEN" edc:desc="" edc:mask="0x1" edc:name="OCDEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OCEEN" edc:desc="" edc:mask="0x1" edc:name="OCEEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OCFEN" edc:desc="" edc:mask="0x1" edc:name="OCFEN" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="OENSYNC" edc:desc="" edc:mask="0x1" edc:name="OENSYNC" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F800320" edc:_begin="0x0" edc:_end="0x90" edc:_modsrc="DOS-01512_ccp_mccp_upb_v1_32bit.Module" edc:_refcount="3" edc:access="nnnn-nnn--nnnnnn----------nnnnnn" edc:cname="CCP3CON3" edc:desc="" edc:impl="0xf73f103f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000-000--000000----------000000" edc:name="CCP3CON3" edc:nzwidth="0x20" edc:por="0000-000--000000----------000000" edc:portals="CLR SET INV" ltx:memberofperipheral="CCP3">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DT" edc:desc="" edc:mask="0x3f" edc:name="DT" edc:nzwidth="6"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="PSSBDF" edc:desc="" edc:mask="0x3" edc:name="PSSBDF" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="PSSACE" edc:desc="" edc:mask="0x3" edc:name="PSSACE" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="POLBDF" edc:desc="" edc:mask="0x1" edc:name="POLBDF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="POLACE" edc:desc="" edc:mask="0x1" edc:name="POLACE" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="OUTM" edc:desc="" edc:mask="0x7" edc:name="OUTM" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="OSCNT" edc:desc="" edc:mask="0x7" edc:name="OSCNT" edc:nzwidth="3"/>
            <edc:SFRFieldDef edc:cname="OETRIG" edc:desc="" edc:mask="0x1" edc:name="OETRIG" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F800330" edc:_begin="0x0" edc:_end="0x90" edc:_modsrc="DOS-01512_ccp_mccp_upb_v1_32bit.Module" edc:_refcount="3" edc:access="-----------nnnnn-----n--rnnccrcr" edc:cname="CCP3STAT" edc:desc="" edc:impl="0x301f14ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----------00000-----0--00000000" edc:name="CCP3STAT" edc:nzwidth="0x20" edc:por="-----------00000-----0--00000000" edc:portals="CLR SET INV" ltx:memberofperipheral="CCP3">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ICBNE" edc:desc="" edc:mask="0x1" edc:name="ICBNE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ICOV" edc:desc="" edc:mask="0x1" edc:name="ICOV" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ICDIS" edc:desc="" edc:mask="0x1" edc:name="ICDIS" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SCEVT" edc:desc="" edc:mask="0x1" edc:name="SCEVT" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ASEVT" edc:desc="" edc:mask="0x1" edc:name="ASEVT" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="TRCLR" edc:desc="" edc:mask="0x1" edc:name="TRCLR" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="TRSET" edc:desc="" edc:mask="0x1" edc:name="TRSET" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CCPTRIG" edc:desc="" edc:mask="0x1" edc:name="CCPTRIG" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ICGARM" edc:desc="" edc:mask="0x1" edc:name="ICGARM" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="RAWIP" edc:desc="" edc:mask="0x1" edc:name="RAWIP" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="RBWIP" edc:desc="" edc:mask="0x1" edc:name="RBWIP" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="TMRLWIP" edc:desc="" edc:mask="0x1" edc:name="TMRLWIP" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="TMRHWIP" edc:desc="" edc:mask="0x1" edc:name="TMRHWIP" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="PRLWIP" edc:desc="" edc:mask="0x1" edc:name="PRLWIP" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:AdjustPoint edc:offset="4"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F800340" edc:_begin="0x0" edc:_end="0x90" edc:_modsrc="DOS-01512_ccp_mccp_upb_v1_32bit.Module" edc:_refcount="3" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CCP3TMR" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="CCP3TMR" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="CCP3">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TMRL" edc:desc="" edc:mask="0xffff" edc:name="TMRL" edc:nzwidth="16"/>
            <edc:SFRFieldDef edc:cname="TMRH" edc:desc="" edc:mask="0xffff" edc:name="TMRH" edc:nzwidth="16"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="TMR" edc:desc="" edc:mask="0xffffffff" edc:name="TMR" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F800350" edc:_begin="0x0" edc:_end="0x90" edc:_modsrc="DOS-01512_ccp_mccp_upb_v1_32bit.Module" edc:_refcount="3" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CCP3PR" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="CCP3PR" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="CCP3">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PRL" edc:desc="" edc:mask="0xffff" edc:name="PRL" edc:nzwidth="16"/>
            <edc:SFRFieldDef edc:cname="PRH" edc:desc="" edc:mask="0xffff" edc:name="PRH" edc:nzwidth="16"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="PR" edc:desc="" edc:mask="0xffffffff" edc:name="PR" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F800360" edc:_begin="0x0" edc:_end="0x90" edc:_modsrc="DOS-01512_ccp_mccp_upb_v1_32bit.Module" edc:_refcount="3" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="CCP3RA" edc:desc="" edc:impl="0x3000ffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000000000000" edc:name="CCP3RA" edc:nzwidth="0x20" edc:por="----------------0000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="CCP3">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CMPA" edc:desc="" edc:mask="0xffff" edc:name="CMPA" edc:nzwidth="16"/>
            <edc:AdjustPoint edc:offset="8"/>
            <edc:AdjustPoint edc:offset="4"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F800370" edc:_begin="0x0" edc:_end="0x90" edc:_modsrc="DOS-01512_ccp_mccp_upb_v1_32bit.Module" edc:_refcount="3" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="CCP3RB" edc:desc="" edc:impl="0x3000ffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000000000000" edc:name="CCP3RB" edc:nzwidth="0x20" edc:por="----------------0000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="CCP3">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CMPB" edc:desc="" edc:mask="0xffff" edc:name="CMPB" edc:nzwidth="16"/>
            <edc:AdjustPoint edc:offset="8"/>
            <edc:AdjustPoint edc:offset="4"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F800380" edc:_begin="0x0" edc:_end="0x90" edc:_modsrc="DOS-01512_ccp_mccp_upb_v1_32bit.Module" edc:_refcount="3" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CCP3BUF" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="CCP3BUF" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="CCP3">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="BUFL" edc:desc="" edc:mask="0xffff" edc:name="BUFL" edc:nzwidth="16"/>
            <edc:SFRFieldDef edc:cname="BUFH" edc:desc="" edc:mask="0xffff" edc:name="BUFH" edc:nzwidth="16"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="BUF" edc:desc="" edc:mask="0xffffffff" edc:name="BUF" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F800390" edc:offset="0x70"/>
      <edc:SFRDef edc:_addr="0x1F800400" edc:_begin="0x0" edc:_end="0x90" edc:_modsrc="DOS-01512_ccp_mccp_upb_v1_32bit.Module" edc:_refcount="4" edc:access="nn--nnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CCP4CON1" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00--0000000000000000000000000000" edc:name="CCP4CON1" edc:nzwidth="0x20" edc:por="00--0000000000000000000000000000" edc:portals="CLR SET INV" ltx:baseofperipheral="CCP4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="MOD" edc:desc="" edc:mask="0xf" edc:name="MOD" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="CCSEL" edc:desc="" edc:mask="0x1" edc:name="CCSEL" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="T32" edc:desc="" edc:mask="0x1" edc:name="T32" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="TMRPS" edc:desc="" edc:mask="0x3" edc:name="TMRPS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="CLKSEL" edc:desc="" edc:mask="0x7" edc:name="CLKSEL" edc:nzwidth="3"/>
            <edc:SFRFieldDef edc:cname="TMRSYNC" edc:desc="" edc:mask="0x1" edc:name="TMRSYNC" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CCPSLP" edc:desc="" edc:mask="0x1" edc:name="CCPSLP" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SIDL" edc:desc="" edc:mask="0x1" edc:name="SIDL" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="FRZ" edc:ishidden="true" edc:islanghidden="true" edc:mask="0x1" edc:name="FRZ" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SYNC" edc:desc="" edc:mask="0x1f" edc:name="SYNC" edc:nzwidth="5"/>
            <edc:SFRFieldDef edc:cname="ALTSYNC" edc:desc="" edc:mask="0x1" edc:name="ALTSYNC" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ONESHOT" edc:desc="" edc:mask="0x1" edc:name="ONESHOT" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="TRIGEN" edc:desc="" edc:mask="0x1" edc:name="TRIGEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OPS" edc:desc="" edc:mask="0xf" edc:name="OPS" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="RTRGEN" edc:desc="" edc:mask="0x1" edc:name="RTRGEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OPSSRC" edc:desc="" edc:mask="0x1" edc:name="OPSSRC" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:FreezeBit edc:freezeval="1" edc:name="CCP 4" edc:pos="14"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F800410" edc:_begin="0x0" edc:_end="0x90" edc:_modsrc="DOS-01512_ccp_mccp_upb_v1_32bit.Module" edc:_refcount="4" edc:access="n------nnn-nnnnnnn-n----nnnnnnnn" edc:cname="CCP4CON2" edc:desc="" edc:impl="0x81dfd0ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0------100-0000000-0----00000000" edc:name="CCP4CON2" edc:nzwidth="0x20" edc:por="0------100-0000000-0----00000000" edc:portals="CLR SET INV" ltx:memberofperipheral="CCP4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ASDG" edc:desc="" edc:mask="0xff" edc:name="ASDG" edc:nzwidth="8"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="SSDG" edc:desc="" edc:mask="0x1" edc:name="SSDG" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ASDGM" edc:desc="" edc:mask="0x1" edc:name="ASDGM" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="PWMRSEN" edc:desc="" edc:mask="0x1" edc:name="PWMRSEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ICS" edc:desc="" edc:mask="0x7" edc:name="ICS" edc:nzwidth="3"/>
            <edc:SFRFieldDef edc:cname="AUXOUT" edc:desc="" edc:mask="0x3" edc:name="AUXOUT" edc:nzwidth="2"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ICGSM" edc:desc="" edc:mask="0x3" edc:name="ICGSM" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="OCAEN" edc:desc="" edc:mask="0x1" edc:name="OCAEN" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="OENSYNC" edc:desc="" edc:mask="0x1" edc:name="OENSYNC" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F800420" edc:_begin="0x0" edc:_end="0x90" edc:_modsrc="DOS-01512_ccp_mccp_upb_v1_32bit.Module" edc:_refcount="4" edc:access="nnnn------n-nn------------------" edc:cname="CCP4CON3" edc:desc="" edc:impl="0xf02c1000" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000------0-00------------------" edc:name="CCP4CON3" edc:nzwidth="0x20" edc:por="0000------0-00------------------" edc:portals="CLR SET INV" ltx:memberofperipheral="CCP4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="6"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="PSSACE" edc:desc="" edc:mask="0x3" edc:name="PSSACE" edc:nzwidth="2"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="POLACE" edc:desc="" edc:mask="0x1" edc:name="POLACE" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="OSCNT" edc:desc="" edc:mask="0x7" edc:name="OSCNT" edc:nzwidth="3"/>
            <edc:SFRFieldDef edc:cname="OETRIG" edc:desc="" edc:mask="0x1" edc:name="OETRIG" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
